#include <DDRAW.h>
#include <D3D.h>
#include <UNKNWN.H>

#include "types.h"
#include "undefined.h"
#include "virtual_memory.h"
#include "window.h"
#include "window_graphics.h"

#define MAX_ENUM_DEVICES 10

typedef struct UnkD3dStruct1 {
    DWORD dwSize;
    float32 unk0x4;
    float32 unk0x8;
    float32 unk0xc;
    int32 unk0x10;
    float32 unk0x14;
    float32 unk0x18;
    float32 unk0x1c;
    int32 unk0x20[11];
    int32 unk0x4c;
} UnkD3dStruct1;

typedef struct UnkTexStruct1 {
    /*0x0*/ uint16 *texBytes;
    /*0x4*/ int32 width;
    /*0x8*/ int32 height;
    /*0xc*/ int32 widthMultipleOfMin;
    /*0x10*/ int32 heightMultipleOfMin;
    /*0x14*/ char unk0x0_pad[16];
    /*0x24*/ int32 unk0x24;
    /*0x28*/ int32 unk0x28;
    /*0x2c*/ int32 unk0x2c;
    /*0x30*/ int32 unk0x30;
    /*0x34*/ int32 unk0x34[32]; // unsure of length
    /*0xb4*/ LPDIRECTDRAWSURFACE4 surface;
    /*0xb8*/ LPDIRECT3DTEXTURE2 texture;
    /*0xbc*/ int32 unk0xbc;
    /*0xc0*/ void *unk0xc0;
} UnkTexStruct1;

typedef struct UnkGraphicsStruct4 {
    DWORD left;
    DWORD top;
    DWORD right;
    DWORD bottom;
} UnkGraphicsStruct4;

typedef struct UnkModelStruct {
    /*0x0*/ char unk0x0;
    /*0x1*/ uint8 unk0x1;
    /*0x2*/ int16 unk0x2;
    /*0x4*/ char unk0x4_pad[48];
    /*0x34*/ float32 x1;
    /*0x38*/ float32 x2;
    /*0x3c*/ float32 x3;
    /*0x40*/ int32 unk0x40_pad;
    /*0x44*/ float32 y1;
    /*0x48*/ float32 y2;
    /*0x4c*/ float32 y3;
    /*0x50*/ int32 unk0x50_pad;
    /*0x54*/ float32 z1;
    /*0x58*/ float32 z2;
    /*0x5c*/ float32 z3;
    /*0x60*/ char unk0x60_pad[100];
    /*0xc4*/ int16 r1; // red
    /*0xc6*/ int16 r2; // red
    /*0xc8*/ int16 r3; // red
    /*0xca*/ int16 unk0xca;
    /*0xcc*/ int16 g1; // green
    /*0xce*/ int16 g2; // green
    /*0xd0*/ int16 g3; // green
    /*0xd2*/ int16 unk0xd2;
    /*0xd4*/ int16 b1; // blue
    /*0xd6*/ int16 b2; // blue
    /*0xd8*/ int16 b3; // blue
    /*0xda*/ int16 unk0xda;
    /*0xdc*/ int32 tu1;
    /*0xe0*/ int32 tu2;
    /*0xe4*/ int32 tu3;
    /*0xe8*/ int32 unk0xe8_pad;
    /*0xec*/ int32 tv1;
    /*0xf0*/ int32 tv2;
    /*0xf4*/ int32 tv3;
    /*0xf8*/ char unk0xf8_pad[8];
    /*0x100*/ int16 texWidth;
    /*0x102*/ int16 texHeight;
    /*0x104*/ int16 unk0x104;
    /*0x106*/ int16 unk0x106;
    /*0x108*/ uint16 *texBytes;
} UnkModelStruct;

typedef struct UnkModelStruct2 {
    /*0x0*/ uint16 *texBytes;
    /*0x4*/ int32 texWidth;
    /*0x8*/ int32 texHeight;
    /*0xc*/ char unk0xc_pad[12];
    /*0x18*/ int32 textureId; // 1-indexed
} UnkModelStruct2;

extern int32 DAT_005f0b60;
extern int32 DAT_005f0b64;
extern int32 DAT_005f8c44;
extern int32 DAT_005f8c48;

extern int32 DAT_004ec038;

extern int32 DAT_0051ad84;
extern int32 DAT_0051ad8c;

extern int32 DAT_0051ada4;
extern DDSCAPS2 gDdsCaps2;
extern DWORD gTotalAvailableDisplayMemory;
extern DWORD gFreeDisplayMemory;
extern int32 DAT_008ec0a4;
extern LPDIRECT3D3 gDirect3D3;

extern char *DAT_01b2dda0;
extern UnkTexStruct1 DAT_01b2ea60[2048];

extern D3DTLVERTEX *gVertexQueue;
extern int32 *gTextureQueue;
extern int32 *gRenderFlagQueue;
extern UnkGraphicsStruct4 *gViewportQueue;

extern GUID *gD3DClassID;

extern LPDIRECT3DDEVICE3 gDirect3DDevice3;

extern D3DDEVICEDESC gD3DHardwareFeatures;
extern D3DDEVICEDESC gD3DSoftwareFeatures;

extern int32 gMaxTextureWidth;
extern int32 gMaxTextureHeight;
extern int32 gMinTextureWidth;
extern int32 gMinTextureHeight;

extern UnkD3dStruct1 DAT_01b910e0;

