#include <DSOUND.H>
#include <STDIO.H>
#include <WINDEF.H>

#include "data.h"
#include "sound.h"
#include "types.h"
#include "undefined.h"
#include "virtual_memory.h"
#include "warnsuppress.h"
#include "window.h"

#define NUM_SOUND_BUFFERS 18

#define KVAG_ADPCM_START 0xE
#define KVAG_ADPCM_LENGTH(bytes) ((bytes)[7] << 24) + ((bytes)[6] << 16) + ((bytes)[5] << 8) + (bytes)[4]
#define KVAG_SAMPLE_RATE(bytes) ((bytes)[0xb] << 24) + ((bytes)[0xa] << 16) + ((bytes)[9] << 8) + (bytes)[8]
#define KVAG_IS_STEREO(bytes) ((bytes)[0xd] << 8) + (bytes)[0xc]

typedef struct {
    /*0x0*/  int32 field0x0;
    /*0x4*/  int32 field0x4;
    /*0x8*/  int32 field0x8;
    /*0xc*/  uint32 field0xc;
    // Byte length of ADPCM data.
    /*0x10*/ uint32 adpcmDataSize;
    /*0x14*/ uint32 field0x14;
    /*0x18*/ FILE *file;
    // Pointer to KVAG header.
    /*0x18*/ uint8 *kvagBytes;
    // Pointer to KVAG ADPCM bytes.
    /*0x20*/ int8 *adpcmBytes;
    /*0x24*/ int32 isStereo;
    /*0x28*/ int32 adpcmIndex1;
    /*0x2c*/ int32 adpcmPredictor1;
    /*0x30*/ int32 adpcmIndex2;
    /*0x34*/ int32 adpcmPredictor2;
    /*0x38*/ char filePath[256];
    /*0x138*/ uint32 field0x138;
} SomeAudioStruct;

// .data

int32 gADPCMIndexTable[16] = {
    -1, -1, -1, -1, 2, 4, 6, 8,
    -1, -1, -1, -1, 2, 4, 6, 8
};
int32 gADPCMStepsizeTable[89] = {
    7, 8, 9, 10, 11, 12, 13,
    14, 16, 17, 19, 21, 23, 25, 28,
    31, 34, 37, 41, 45, 50, 55, 60,
    66, 73, 80, 88, 97, 107, 118,
    130, 143, 157, 173, 190, 209, 230,
    253, 279, 307, 337, 371, 408, 449,
    494, 544, 598, 658, 724, 796, 876,
    963, 1060, 1166, 1282, 1411, 1552,
    1707, 1878, 2066, 2272, 2499, 2749,
    3024, 3327, 3660, 4026, 4428, 4871,
    5358, 5894, 6484, 7132, 7845, 8630,
    9493, 10442, 11487, 12635, 13899,
    15289, 16818, 18500, 20350, 22385,
    24623, 27086, 29794, 32767
};

// .bss

bool8 gSoundSystemInitialized;

int16 gADPCMPredictor;
int8 gADPCMIndex;
int16 gADPCMPredictor2;
int8 gADPCMIndex2;

LPDIRECTSOUND gDirectSound;

LPDIRECTSOUNDBUFFER gSoundBuffers1[NUM_SOUND_BUFFERS];
LPDIRECTSOUNDBUFFER gSoundBuffers2[NUM_SOUND_BUFFERS];
